refined_pisoFoam_snappyPipe/Allrun-parallel
./Allclean

#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh
restore0Dir
decomposePar > log.meshDecomposePar
runParallel snappyHexMesh -overwrite
runParallel topoSet
runParallel createPatch -overwrite
reconstructParMesh -constant -mergeTol 1E-06 > log.reconstructParMesh
touch refined_snappy_pipe.foam


#restore0Dir
#runApplication decomposePar
#runParallel pisoFoam
#runApplication reconstructPar
#reconstruction complete :) means i can view results...
